Repository: Nakanokappei/window-resize
Catalog: Resources/*.lproj/Localizable.strings
Languages: es, fr, hi, id, it, ja, pt, th, vi

# menu.resize
source: Resize
es: Redimensionar
fr: Redimensionner
hi: आकार बदलें
id: Ubah Ukuran
it: Ridimensiona
ja: リサイズ
pt: Redimensionar
th: ปรับขนาด
vi: Đổi kích thước

# menu.settings
source: Settings...
es: Ajustes...
fr: Paramètres...
hi: सेटिंग्स...
id: Pengaturan...
it: Impostazioni...
ja: 設定...
pt: Configurações...
th: การตั้งค่า...
vi: Cài đặt...

# menu.quit
source: Quit Window Resize
es: Salir de Window Resize
fr: Quitter Window Resize
hi: Window Resize बंद करें
id: Keluar Window Resize
it: Esci da Window Resize
ja: Window Resize を終了
pt: Encerrar Window Resize
th: ออกจาก Window Resize
vi: Thoát Window Resize

# menu.loading
source: Loading...
es: Cargando...
fr: Chargement...
hi: लोड हो रहा है...
id: Memuat...
it: Caricamento...
ja: 読み込み中...
pt: Carregando...
th: กำลังโหลด...
vi: Đang tải...

# menu.no-windows
source: (No windows found)
es: (No se encontraron ventanas)
fr: (Aucune fenêtre trouvée)
hi: (कोई विंडो नहीं मिली)
id: (Tidak ada jendela ditemukan)
it: (Nessuna finestra trovata)
ja: （ウインドウが見つかりません）
pt: (Nenhuma janela encontrada)
th: (ไม่พบหน้าต่าง)
vi: (Không tìm thấy cửa sổ nào)

# menu.untitled
source: (Untitled)
es: (Sin título)
fr: (Sans titre)
hi: (बिना शीर्षक)
id: (Tanpa Judul)
it: (Senza titolo)
ja: （無題）
pt: (Sem Título)
th: (ไม่มีชื่อ)
vi: (Chưa đặt tên)

# alert.resize-failed.title
source: Resize Failed
es: Error al redimensionar
fr: Échec du redimensionnement
hi: आकार बदलना विफल
id: Gagal Mengubah Ukuran
it: Ridimensionamento non riuscito
ja: リサイズに失敗しました
pt: Falha ao Redimensionar
th: ปรับขนาดไม่สำเร็จ
vi: Đổi kích thước thất bại

# alert.resize-failed.body
source: Could not resize the window. The application may not support accessibility-based resizing, or the window may be in full-screen mode.
es: No se pudo redimensionar la ventana. Es posible que la aplicación no admita el redimensionamiento mediante accesibilidad o que la ventana esté en modo de pantalla completa.
fr: Impossible de redimensionner la fenêtre. L'application ne prend peut-être pas en charge le redimensionnement par accessibilité, ou la fenêtre est en mode plein écran.
hi: विंडो का आकार नहीं बदला जा सका। ऐप्लिकेशन एक्सेसिबिलिटी-आधारित रीसाइज़ को सपोर्ट नहीं कर सकता, या विंडो फ़ुल-स्क्रीन मोड में हो सकती है।
id: Tidak dapat mengubah ukuran jendela. Aplikasi mungkin tidak mendukung pengubahan ukuran berbasis aksesibilitas, atau jendela sedang dalam mode layar penuh.
it: Impossibile ridimensionare la finestra. L'applicazione potrebbe non supportare il ridimensionamento tramite accessibilità oppure la finestra potrebbe essere in modalità a schermo intero.
ja: ウインドウのサイズを変更できませんでした。アプリケーションがアクセシビリティによるリサイズに対応していないか、フルスクリーンモードの可能性があります。
pt: Não foi possível redimensionar a janela. O aplicativo pode não suportar redimensionamento via acessibilidade, ou a janela pode estar em modo tela cheia.
th: ไม่สามารถปรับขนาดหน้าต่างได้ แอปพลิเคชันอาจไม่รองรับการปรับขนาดผ่านการช่วยการเข้าถึง หรือหน้าต่างอาจอยู่ในโหมดเต็มหน้าจอ
vi: Không thể đổi kích thước cửa sổ. Ứng dụng có thể không hỗ trợ đổi kích thước qua trợ năng, hoặc cửa sổ đang ở chế độ toàn màn hình.

# alert.stale-permission.title
source: Accessibility Permission Needs Refresh
es: El permiso de accesibilidad necesita actualizarse
fr: Actualisation requise de l'autorisation d'accessibilité
hi: एक्सेसिबिलिटी अनुमति को रीफ़्रेश करना ज़रूरी है
id: Izin Aksesibilitas Perlu Diperbarui
it: Aggiornamento necessario per il permesso di accessibilità
ja: アクセシビリティ権限の更新が必要です
pt: Permissão de Acessibilidade Precisa ser Atualizada
th: สิทธิ์การช่วยการเข้าถึงต้องรีเฟรช
vi: Quyền trợ năng cần được làm mới

# alert.stale-permission.body
source: The app was rebuilt and the previous accessibility permission is no longer valid. Please go to: System Settings > Privacy & Security > Accessibility Then toggle "Window Resize" OFF and ON again, or remove it and re-add it.
es: La aplicación se recompiló y el permiso de accesibilidad anterior ya no es válido. Ve a: Ajustes del Sistema > Privacidad y seguridad > Accesibilidad Desactiva "Window Resize" y vuelve a activarlo, o elimínalo y añádelo de nuevo.
fr: L'application a été recompilée et l'autorisation d'accessibilité précédente n'est plus valide. Veuillez aller dans : Réglages du système > Confidentialité et sécurité > Accessibilité Puis désactivez « Window Resize » et réactivez-le, ou supprimez-le et rajoutez-le.
hi: ऐप को फिर से बिल्ड किया गया है और पिछली एक्सेसिबिलिटी अनुमति अब मान्य नहीं है। कृपया यहाँ जाएँ: सिस्टम सेटिंग्स > प्राइवेसी और सिक्योरिटी > एक्सेसिबिलिटी "Window Resize" को ऑफ़ करके फिर ऑन करें, या उसे हटाकर दोबारा जोड़ें।
id: Aplikasi telah dibangun ulang dan izin aksesibilitas sebelumnya tidak lagi berlaku. Silakan buka: Pengaturan Sistem > Privasi & Keamanan > Aksesibilitas Matikan "Window Resize" lalu nyalakan kembali, atau hapus dan tambahkan kembali.
it: L'app è stata ricompilata e il permesso di accessibilità precedente non è più valido. Vai su: Impostazioni di Sistema > Privacy e sicurezza > Accessibilità Disattiva "Window Resize" e riattivalo, oppure rimuovilo e aggiungilo di nuovo.
ja: アプリが再ビルドされたため、以前のアクセシビリティ権限が無効になりました。 以下の手順で操作してください： システム設定 > プライバシーとセキュリティ > アクセシビリティ 「Window Resize」をオフにしてからオンに戻すか、 一度削除して再追加してください。
pt: O app foi reconstruído e a permissão de acessibilidade anterior não é mais válida. Por favor, vá para: Configurar Sistema > Privacidade e Segurança > Acessibilidade Desative "Window Resize" e ative novamente, ou remova e adicione novamente.
th: แอปถูกบิลด์ใหม่และสิทธิ์การช่วยการเข้าถึงเดิมไม่สามารถใช้งานได้อีกต่อไป กรุณาไปที่: การตั้งค่าระบบ > ความเป็นส่วนตัวและความปลอดภัย > การช่วยการเข้าถึง ปิด "Window Resize" แล้วเปิดใหม่ หรือลบออกแล้วเพิ่มอีกครั้ง
vi: Ứng dụng đã được build lại và quyền trợ năng trước đó không còn hiệu lực. Vui lòng đi tới: Cài đặt hệ thống > Quyền riêng tư & Bảo mật > Trợ năng Tắt "Window Resize" rồi bật lại, hoặc xóa và thêm lại.

# alert.button.open-settings
source: Open Settings
es: Abrir Ajustes
fr: Ouvrir les réglages
hi: सेटिंग्स खोलें
id: Buka Pengaturan
it: Apri Impostazioni
ja: 設定を開く
pt: Abrir Configurações
th: เปิดการตั้งค่า
vi: Mở Cài đặt

# settings.title
source: Window Resize Settings
es: Ajustes de Window Resize
fr: Paramètres de Window Resize
hi: Window Resize सेटिंग्स
id: Pengaturan Window Resize
it: Impostazioni di Window Resize
ja: Window Resize 設定
pt: Configurações do Window Resize
th: การตั้งค่า Window Resize
vi: Cài đặt Window Resize

# settings.preset-sizes
source: Preset Sizes
es: Tamaños predefinidos
fr: Tailles prédéfinies
hi: प्रीसेट आकार
id: Ukuran Preset
it: Dimensioni predefinite
ja: プリセットサイズ
pt: Tamanhos Predefinidos
th: ขนาดที่ตั้งไว้
vi: Kích thước đặt sẵn

# settings.built-in
source: Built-in
es: Integrados
fr: Intégrées
hi: अंतर्निहित
id: Bawaan
it: Integrate
ja: 内蔵
pt: Integrados
th: ในตัว
vi: Có sẵn

# settings.custom
source: Custom
es: Personalizados
fr: Personnalisées
hi: कस्टम
id: Kustom
it: Personalizzate
ja: カスタム
pt: Personalizados
th: กำหนดเอง
vi: Tùy chỉnh

# settings.no-custom-sizes
source: No custom sizes added
es: No se han añadido tamaños personalizados
fr: Aucune taille personnalisée ajoutée
hi: कोई कस्टम आकार नहीं जोड़ा गया
id: Belum ada ukuran kustom
it: Nessuna dimensione personalizzata aggiunta
ja: カスタムサイズはまだありません
pt: Nenhum tamanho personalizado adicionado
th: ยังไม่มีขนาดที่กำหนดเอง
vi: Chưa thêm kích thước tùy chỉnh nào

# settings.width
source: Width
es: Ancho
fr: Largeur
hi: चौड़ाई
id: Lebar
it: Larghezza
ja: 幅
pt: Largura
th: ความกว้าง
vi: Rộng

# settings.height
source: Height
es: Alto
fr: Hauteur
hi: ऊँचाई
id: Tinggi
it: Altezza
ja: 高さ
pt: Altura
th: ความสูง
vi: Cao

# settings.add
source: Add
es: Añadir
fr: Ajouter
hi: जोड़ें
id: Tambah
it: Aggiungi
ja: 追加
pt: Adicionar
th: เพิ่ม
vi: Thêm

# settings.remove
source: Remove
es: Eliminar
fr: Supprimer
hi: हटाएँ
id: Hapus
it: Rimuovi
ja: 削除
pt: Remover
th: ลบ
vi: Xóa

# settings.launch-at-login
source: Launch at Login
es: Iniciar sesión automáticamente
fr: Lancer au démarrage
hi: लॉगिन पर शुरू करें
id: Jalankan Saat Login
it: Avvia al login
ja: ログイン時に起動
pt: Iniciar ao Fazer Login
th: เปิดเมื่อเข้าสู่ระบบ
vi: Khởi chạy khi đăng nhập

# settings.accessibility.enabled
source: Accessibility: Enabled
es: Accesibilidad: activada
fr: Accessibilité : activée
hi: एक्सेसिबिलिटी: सक्षम
id: Aksesibilitas: Aktif
it: Accessibilità: abilitata
ja: アクセシビリティ：有効
pt: Acessibilidade: Ativada
th: การช่วยการเข้าถึง: เปิดใช้งานแล้ว
vi: Trợ năng: Đã bật

# settings.accessibility.needs-refresh
source: Accessibility: Needs Refresh (toggle OFF→ON in Settings)
es: Accesibilidad: necesita actualizarse (desactivar→activar en Ajustes)
fr: Accessibilité : actualisation requise (désactiver→réactiver dans Réglages)
hi: एक्सेसिबिलिटी: रीफ़्रेश ज़रूरी (सेटिंग्स में ऑफ़→ऑन करें)
id: Aksesibilitas: Perlu Diperbarui (matikan→nyalakan di Pengaturan)
it: Accessibilità: aggiornamento necessario (disattiva→riattiva in Impostazioni)
ja: アクセシビリティ：更新が必要（設定でオフ→オンに切替）
pt: Acessibilidade: Precisa Atualizar (desative→ative nas Configurações)
th: การช่วยการเข้าถึง: ต้องรีเฟรช (ปิด→เปิดในการตั้งค่า)
vi: Trợ năng: Cần làm mới (tắt→bật trong Cài đặt)

# settings.accessibility.not-enabled
source: Accessibility: Not Enabled
es: Accesibilidad: no activada
fr: Accessibilité : désactivée
hi: एक्सेसिबिलिटी: अक्षम
id: Aksesibilitas: Tidak Aktif
it: Accessibilità: non abilitata
ja: アクセシビリティ：無効
pt: Acessibilidade: Desativada
th: การช่วยการเข้าถึง: ไม่ได้เปิดใช้งาน
vi: Trợ năng: Chưa bật

# settings.screenshot.enabled
source: Take screenshot after resize
fr: Capturer après le redimensionnement
hi: आकार बदलने के बाद स्क्रीनशॉट लें
id: Ambil tangkapan layar setelah mengubah ukuran
it: Scatta istantanea dopo il ridimensionamento
ja: リサイズ後にスクリーンショットを撮影
pt: Capturar após redimensionar
th: ถ่ายภาพหน้าจอหลังปรับขนาด
vi: Chụp ảnh sau khi thay đổi kích thước

# settings.screenshot.save-to-file
source: Save to file
fr: Enregistrer dans un fichier
hi: फ़ाइल में सहेजें
id: Simpan ke file
it: Salva su file
ja: ファイルに保存
pt: Salvar em arquivo
th: บันทึกเป็นไฟล์
vi: Lưu vào tệp

# settings.screenshot.choose-folder
source: Select a folder to save screenshots
fr: Sélectionnez un dossier pour les captures
id: Pilih folder untuk menyimpan tangkapan layar
it: Seleziona una cartella per gli screenshot

# settings.screenshot.choose-folder.button
source: Choose…
fr: Choisir…
id: Pilih…
it: Scegli…

# settings.screenshot.no-folder-selected
source: No folder selected
fr: Aucun dossier sélectionné
id: Belum ada folder dipilih
it: Nessuna cartella selezionata

# settings.screenshot.copy-to-clipboard
source: Copy to clipboard
fr: Copier dans le presse-papiers
hi: क्लिपबोर्ड पर कॉपी करें
id: Salin ke papan klip
it: Copia negli appunti
ja: クリップボードにコピー
pt: Copiar para a área de transferência
th: คัดลอกไปยังคลิปบอร์ด
vi: Sao chép vào bảng nhớ tạm

# alert.screen-recording.title
source: Screen Recording Permission Required
fr: Autorisation d'enregistrement d'écran requise
hi: स्क्रीन रिकॉर्डिंग अनुमति आवश्यक
id: Izin Perekaman Layar Diperlukan
it: Autorizzazione registrazione schermo richiesta
ja: 画面収録の権限が必要です
pt: Permissão de gravação de tela necessária
th: ต้องการสิทธิ์บันทึกหน้าจอ
vi: Cần quyền ghi màn hình

# alert.screen-recording.body
source: To take screenshots of windows, Screen Recording permission is required. Please go to: System Settings > Privacy & Security > Screen Recording Then enable "Window Resize".
fr: Pour capturer des fenêtres, l'autorisation d'enregistrement d'écran est requise. Accédez à : Réglages du système > Confidentialité et sécurité > Enregistrement d'écran Puis activez « Window Resize ».
hi: विंडो का स्क्रीनशॉट लेने के लिए स्क्रीन रिकॉर्डिंग अनुमति आवश्यक है। कृपया जाएँ: सिस्टम सेटिंग्स > गोपनीयता और सुरक्षा > स्क्रीन रिकॉर्डिंग फिर "Window Resize" को सक्षम करें।
id: Untuk mengambil tangkapan layar jendela, izin perekaman layar diperlukan. Silakan buka: Pengaturan Sistem > Privasi & Keamanan > Perekaman Layar Kemudian aktifkan "Window Resize".
it: Per acquisire istantanee delle finestre, è necessaria l'autorizzazione per la registrazione dello schermo. Vai su: Impostazioni di Sistema > Privacy e Sicurezza > Registrazione schermo Quindi attiva "Window Resize".
ja: ウインドウのスクリーンショットを撮影するには、画面収録の権限が必要です。 以下の手順で操作してください： システム設定 > プライバシーとセキュリティ > 画面収録 「Window Resize」を有効にしてください。
pt: Para capturar janelas, a permissão de gravação de tela é necessária. Acesse: Ajustes do Sistema > Privacidade e Segurança > Gravação de Tela Então ative "Window Resize".
th: ในการถ่ายภาพหน้าจอของหน้าต่าง จำเป็นต้องมีสิทธิ์บันทึกหน้าจอ กรุณาไปที่: การตั้งค่าระบบ > ความเป็นส่วนตัวและความปลอดภัย > บันทึกหน้าจอ จากนั้นเปิดใช้งาน "Window Resize"
vi: Để chụp ảnh cửa sổ, cần có quyền ghi màn hình. Vui lòng đi tới: Cài đặt hệ thống > Quyền riêng tư & Bảo mật > Ghi màn hình Sau đó bật "Window Resize".

# alert.button.ok
source: OK
hi: ठीक है
th: ตกลง
